<a href="https://colab.research.google.com/github/Shivaram17/AccEngine_PythonDemoCodes/blob/main/1005strsplitDemo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

df = pd.DataFrame({
   'EmployeeId': ['001', '002', '003', '004', '005'],
   'City': ['Mumbai|Bangalore', 'Pune|Mumbai|Delhi', 'Mumbai|Bangalore', 'Mumbai|Pune', 'Bangalore'] 
})

df

  EmployeeId               City
0        001   Mumbai|Bangalore
1        002  Pune|Mumbai|Delhi
2        003   Mumbai|Bangalore
3        004        Mumbai|Pune
4        005          Bangalore

In [2]:
# Exploding into multiple cells

# We start with creating a new dataframe from the series with EmployeeId as the index
new_df = pd.DataFrame(df.City.str.split('|').tolist(), index=df.EmployeeId).stack()
new_df

EmployeeId
001         0       Mumbai
            1    Bangalore
002         0         Pune
            1       Mumbai
            2        Delhi
003         0       Mumbai
            1    Bangalore
004         0       Mumbai
            1         Pune
005         0    Bangalore
dtype: object

In [3]:
# We now want to get rid of the secondary index
# To do this, we will make EmployeeId as a column (it can't be an index since the values will be duplicate)
new_df = new_df.reset_index([0, 'EmployeeId'])
new_df

  EmployeeId          0
0        001     Mumbai
1        001  Bangalore
2        002       Pune
3        002     Mumbai
4        002      Delhi
5        003     Mumbai
6        003  Bangalore
7        004     Mumbai
8        004       Pune
9        005  Bangalore

In [4]:
# The final step is to set the column names as we want them
new_df.columns = ['EmployeeId', 'City']
new_df

  EmployeeId       City
0        001     Mumbai
1        001  Bangalore
2        002       Pune
3        002     Mumbai
4        002      Delhi
5        003     Mumbai
6        003  Bangalore
7        004     Mumbai
8        004       Pune
9        005  Bangalore